biblioteca-agora/app/Http/Controllers/LivroController.php

    public function index()
    {
        $livros = Livro::paginate(10);
        $autores = Autor::all();
        $generos = Genero::all();
---
select * from `livro` limit 10 offset 0
select count(*) as aggregate from `livro`
select * from `autor`
select * from `genero`

    public function pesquisar(Request $request)
    {
        $livros = Livro::where('titulo', 'like', '%' . $request->pesquisa . '%')
            ->orWhere('editora', 'like', '%' . $request->pesquisa . '%')
            ->orWhereHas('autor', function ($query) use ($request) {
                $query->where('nome', 'like', '%' . $request->pesquisa . '%');
            })
            ->orWhereHas('genero', function ($query) use ($request) {
                $query->where('nome', 'like', '%' . $request->pesquisa . '%');
            })
            ->paginate(10);

        $autores = Autor::all();
        $generos = Genero::all();
---
select * from `livro` where `titulo` like '%odit%' or `editora` like '%odit%' or exists (select * from `autor` where `livro`.`autor_id` = `autor`.`id` and `nome` like '%odit%') or exists (select * from `genero` where `livro`.`genero_id` = `genero`.`id` and `nome` like '%odit%') limit 10 offset 0
select count(*) as aggregate from `livro` where `titulo` like '%odit%' or `editora` like '%odit%' or exists (select * from `autor` where `livro`.`autor_id` = `autor`.`id` and `nome` like '%odit%') or exists (select * from `genero` where `livro`.`genero_id` = `genero`.`id` and `nome` like '%odit%')
select * from `autor`
select * from `genero`


            return redirect()->back()->with('message', $mensagem)->withInput();
        }
        $autor = Autor::firstOrCreate(['nome' => $dados['autor']]);
        $genero = Genero::firstOrCreate(['nome' => $dados['genero']]);
---
insert into `autor` (`nome`, `updated_at`, `created_at`) values ('Menelaos Stephanides', '2023-09-30 22:37:45', '2023-09-30 22:37:45')
select * from `autor` where (`nome` = 'Menelaos Stephanides') limit 1
insert into `genero` (`nome`, `updated_at`, `created_at`) values ('Mitologia Clássica', '2023-09-30 22:37:45', '2023-09-30 22:37:45')
select * from `genero` where (`nome` = 'Mitologia Clássica') limit 1

    public function livro(string $id){
        $livro = Livro::with('emprestimos')->find($id);

        foreach ($livro->emprestimos as $emprestimo) {
            //convertendo datas para o formato brasileiro
            $emprestimo->data_emprestimo = date('d/m/Y', strtotime($emprestimo->data_emprestimo));
            $emprestimo->data_devolucao_esperada = date('d/m/Y', strtotime($emprestimo->data_devolucao_esperada));
            if($emprestimo->data_devolucao != null){
                $emprestimo->data_devolucao = date('d/m/Y', strtotime($emprestimo->data_devolucao));
            }

            //Verificando se empréstimo não foi devolvido e está atrasado
            $data_devolucao_esperada = strtotime($emprestimo->data_devolucao_esperada);
            $dataAtual = strtotime(date('Y-m-d'));
            if($emprestimo->data_devolucao == null && $dataAtual > $data_devolucao_esperada){
                $emprestimo->atrasado = true;
            }else{
                $emprestimo->atrasado = false;
            }
        }

        $autores = Autor::all();
        $generos = Genero::all();
---
select * from `emprestimo` where `emprestimo`.`livro_id` in (31)
select * from `livro` where `livro`.`id` = '31' limit 1
select * from `autor`
select * from `genero`

            return redirect()->back()->with('message', $mensagem)->withInput();
        }

        $autor = Autor::firstOrCreate(['nome' => $dados['autor']]);
        $genero = Genero::firstOrCreate(['nome' => $dados['genero']]);

        $livro = Livro::find($id);
---
select * from `autor` where (`nome` = 'Dr. Velva Welch') limit 1
select * from `genero` where (`nome` = 'asperiores') limit 1
select * from `livro` where `livro`.`id` = '31' limit 1